HELYXcore-4.4.0/examples/legacy/multiphase/reactingTwoPhaseEulerFoam/LES/bubbleColumn/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
);

regions
(
    boxToCell
    {
        box (0 0 -0.1) (0.15 0.701 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
        );
    }
);


// ************************************************************************* //
